{
  "tur": {
    "nav": {
      "home": "Anasayfa",
      "about": "Hakkımda",
      "skills": "Yetenekler",
      "portfolio": "Portfolyo",
      "contact": "İletişim"
    },
    "home": {
      "job": "Full Stack Developer",
      "description": "Ben, Türkiye merkezli yaratıcı bir Full Stack Developer'im ve işime son derece tutkulu ve bağlıyım.",
      "sayHello": "Bana Ulaşın",
      "scroll": "Aşağı Kaydırınız"
    },
    "about": {
      "title": "Hakkımda",
      "subtitle": "Ben Kimim?",
      "description": "Kodlarını anlamlı ve kullanıcı dostu dijital deneyimlere dönüştürmek için çabalayan kendi kendini yetiştirmiş bir geliştiriciyim. Kodlama yolculuğum, merak ve problem çözme tutkusunun harmanıyla besleniyor. Harika projelerde işbirliği yapmaktan ve teknoloji dünyasına biraz yaratıcılık katmaktan heyecan duyuyorum.",
      "cv": "CV'mi İndirin"
    },
    "skills": {
      "title": "Yetenekler",
      "subtitle": "Teknik Seviyem",
      "advanced": "İleri",
      "intermediate": "Orta",
      "basic": "Başlangıç"
    },
    "qualification": {
      "title": "Nitelikler",
      "subtitle": "Kişisel Yolculuğum",
      "education": "Eğitim",
      "experience": "Deneyim",
      "highschool": "Lise",
      "highschoolName": "Ereğli Anadolu Lisesi",
      "collage": "Sakarya Üniversitesi",
      "major": "Elektrik Elektronik Mühendisliği",
      "patika": "Patika.dev",
      "bootcamp": "Timus Full Stack Bootcamp",
      "intern": "Mühendislik Stajı",
      "sedas": "Sakarya Elektrik Dağıtım A.Ş",
      "engineer": "Elektrik Elektronik Mühendisi",
      "federal": "Federal Group",
      "basarSoft": "Başarsoft / İçişleri Bakanlığı",
      "fullStack": "Yazılım Geliştirici",
      "ongoing": "Devam Ediyor"
    },
    "work": {
      "title": "Portfolyo",
      "subtitle": "En Son Projelerim",
      "estateDesc": "MERN yapısı ile oluşturulmış bir emlakçılık uygulaması. Bu emlakçılık platformu, kullanıcıların kendi emlaklarını yükleyip diğer kullanıcıların bu emlakları görmesine ve detaylı arama filtreleriyle araştırma yapmasına olanak tanır. Kullanıcılar, kendi profillerini oluşturup düzenleyebilir ve emlak sahipleriyle doğrudan e-posta üzerinden iletişim kurabilir. Demo link çalışıyor fakat yaklaşık bir 40-45 saniye beklemeniz gerekiyor. Projeyi Render uygulaması üzerine yüklediğim için malesef böyle bir durum mevcut.",
      "foodiDesc": "MERN yapısı ile oluşturulmuş bir yemek servisi uygulaması. Bu yemek servisi uygulaması, kullanıcıların menüleri inceleyip kendi sepetlerini oluşturmasına olanak tanır. Ayrıca, ürün ekleme, düzenleme ve silme işlemleri için bir admin paneli sunar. Kullanıcılar, kendi profillerini oluşturup düzenleyebilir ve kişiselleştirilmiş bir deneyim yaşayabilir.",
      "yelpDesc": "EJS templateleri ve ExpressJS ile oluşturulmuş bir kamp yeri uygulaması. Bu kamp yeri uygulaması, kullanıcıların kendi profillerini oluşturup düzenlemesine, kullandıkları ve beğendikleri kamp yerlerini yüklemesine olanak tanır. Diğer kullanıcıların paylaştığı kamp yerlerine puan verip yorum yapabilirler. Kamp yerleri ayrıca büyük bir dünya haritası üzerinden görüntülenebilir. Demo link çalışıyor fakat yaklaşık bir 40-45 saniye beklemeniz gerekiyor. Projeyi Render uygulaması üzerine yüklediğim için malesef böyle bir durum mevcut.",
      "timusDesc": "VueJS ve NestJS ile oluşturulmuş bir fabrika kullanıcı dashboard uygulaması",
      "timusTitle": "Timus Bootcamp Final Projesi",
      "vellaConceptDesc": "MERN yapısı ile oluşturulmış bir mobilya uygulaması. Vellaconcept'in mobilyalarını tanıtmak amacıyla oluşturulan bu web sitesi, kullanıcıların gelişmiş arama filtreleriyle ürünleri incelemesine ve araştırmasına olanak tanır. Şirket yetkilileri için, yeni ürün ekleme, düzenleme ve silme işlemleri yapabilecekleri şifre korumalı bir admin paneli bulunmaktadır. Ayrıca, site 4 farklı dil seçeneği sunarak uluslararası kullanıcılar için kolaylık sağlar. İlk gerçek ve yayınlanmış projem olan bu mobilya sitesi, full stack developer olarak kariyerimde önemli bir adımı temsil ediyor.",
      "code": "Kodlar",
      "soloDesc": "React ile geliştirdiğim bu proje, Solo Arge adlı bir firmanın kurumsal kimliğini yansıtan modern ve kullanıcı dostu bir web sitesi olarak tasarlandı. Projede üç dil seçeneği (Türkçe, İngilizce ve Arapça) sunularak farklı bölgelerdeki kullanıcıların siteyi rahatlıkla kullanabilmesi sağlandı. Bu proje sayesinde React ile olan front-end yeteneklerimi ileri seviyeye taşıdım. Özellikle çok dilli yapı kurma, bileşen bazlı (component-based) geliştirme ve responsive tasarım konularında deneyim kazandım."
    },
    "contact": {
      "title": "Benimle Temasa Geçin",
      "subtitle": "Bana Ulaşın",
      "talk": "Bana Bir Şeyler Yazın!",
      "hi": "Haydi Bana Merhaba De!",
      "write": "Bana Yazın",
      "name": "İsim",
      "insertName": "İsminizi Giriniz...",
      "insertEmail": "Emailinizi Giriniz...",
      "message": "Mesajınız",
      "insertMessage": "Mesajınızı Giriniz...",
      "send": "Mesajı Gönder",
      "messageSuccess": "Mesajınız Gönderildi!",
      "messageFail": "Bir Şeyler Ters Gitti! Lütfen Daha Sonra Tekrar Dene"
    },
    "footer": {
      "copy": "Bütün hakları saklıdır."
    }
  },
  "en": {
    "nav": {
      "home": "Home",
      "about": "About",
      "skills": "Skills",
      "portfolio": "Portfolio",
      "contact": "Contact"
    },
    "home": {
      "job": "Full Stack Developer",
      "description": "I'm a creative Full Stack Developer based in Turkey, and I'm very passionate and dedicated to my work.",
      "sayHello": "Say Hello",
      "scroll": "Scroll Down"
    },
    "about": {
      "title": "About Me",
      "subtitle": "My Introduction",
      "description": "I'm a self-taught developer on a mission to turn lines of code into meaningful and user-friendly digital experiences. My coding journey is fueled by a mix of curiosity and a passion for problem-solving. I'm excited to keep learning, collaborate on cool projects, and bring a bit of creativity to the tech world.",
      "cv": "Download CV"
    },
    "skills": {
      "title": "Skills",
      "subtitle": "My Technical Level",
      "advanced": "Advanced",
      "intermediate": "Intermediate",
      "basic": "Basic"
    },
    "qualification": {
      "title": "Qualification",
      "subtitle": "My Personal Journey",
      "education": "Education",
      "experience": "Experience",
      "highschool": "Highschool",
      "highschoolName": "Eregli Anatolian Highschool",
      "collage": "Sakarya University",
      "major": "Electrical Electronics Engineering",
      "patika": "Patika.dev",
      "bootcamp": "Timus Full Stack Bootcamp",
      "intern": "Engineering Internship",
      "sedas": "Sakarya Electric Distribution INC",
      "engineer": "Electrical Electronics Engineer",
      "federal": "Federal Group",
      "basarSoft": "Başarsoft / Ministry Of The Interior",
      "fullStack": "Software Developer",
      "ongoing": "Ongoing"
    },
    "work": {
      "title": "Portfolio",
      "subtitle": "My Latest Work",
      "estateDesc": "A Real Estate application created using the MERN stack. This real estate platform allows users to upload their properties and enables others to view and explore them using advanced search filters. Users can create and edit their profiles and directly communicate with property owners via email.The demo link is working, but you need to wait approximately 40-45 seconds. Unfortunately, this delay occurs because the project is hosted on Render.",
      "foodiDesc": "A Food Delivery application created using the MERN stack. This food delivery application allows users to browse menus and create their own carts. It also features an admin panel for adding, editing, and deleting products. Additionally, users can create and edit their profiles, offering a personalized experience.",
      "yelpDesc": "A Campground application created using EJS templates and ExpressJS. This camping site application allows users to create and edit their profiles, upload the campsites they have visited and liked, and rate or comment on other users' shared campsites. Campsites can also be viewed on a large world map.The demo link is working, but you need to wait approximately 40-45 seconds. Unfortunately, this delay occurs because the project is hosted on Render.",
      "timusDesc": "A Factory user dashboard application created using the MERN stack.",
      "timusTitle": "Timus Bootcamp Final Case",
      "vellaConceptDesc": "A Furniture application created using the MERN stack. This website, created to showcase Vellaconcept's furniture, allows users to explore and search for products using advanced filters. For company officials, there is a password-protected admin panel that enables adding, editing, and deleting products. Additionally, the site offers 4 language options, making it accessible to international users. This furniture website, my first real and published project, marks an important milestone in my career as a full stack developer.",
      "soloDesc": "This project, developed with React, was designed as a modern and user-friendly corporate website that reflects the identity of a company called Solo Arge. It offers three language options (Turkish, English, and Arabic) to ensure accessibility for users from different regions. Through this project, I significantly advanced my front-end development skills with React. I gained valuable experience particularly in implementing multilingual architecture, component-based development and responsive design.",
      "code": "Codes"
    },
    "contact": {
      "title": "Get In Touch",
      "subtitle": "Contact Me",
      "talk": "Talk To Me!",
      "hi": "Tell Me Hi!",
      "write": "Write Me",
      "name": "Name",
      "insertName": "Insert Your Name...",
      "insertEmail": "Insert Your Email...",
      "message": "Message",
      "insertMessage": "Insert Your Message...",
      "send": "Send Message",
      "messageSuccess": "Your Message Has Been Sent!",
      "messageFail": "Something Went Wrong! Please Try Again Later"
    },
    "footer": {
      "copy": "All rights reserved."
    }
  }
}
